wei134102/OpenFIRE-Firmware-ESP32/src/main.cpp
                        #ifdef USES_DISPLAY
                            FW_Common::OLED.PauseListUpdate(ExtDisplay::ScreenPause_Calibrate);
                        #endif // USES_DISPLAY

                    } else if(FW_Common::buttons.pressedReleased & FW_Const::ExitPauseModeBtnMask) {
                        if(!OF_Serial::serialMode)
                            Serial.println("Exiting profile selection.");

                        pauseModeSelectingProfile = false;

                        #ifdef LED_ENABLE
                            for(uint i = 0; i < 2; ++i) {
                                OF_RGB::LedUpdate(180,180,180);
                                delay(125);
                                OF_RGB::LedOff();
                                delay(100);
                            }
                            OF_RGB::LedUpdate(255,0,0);
                        #endif // LED_ENABLE

                        FW_Common::pauseModeSelection = FW_Const::PauseMode_Calibrate;

                        #ifdef USES_DISPLAY
                            FW_Common::OLED.PauseListUpdate(ExtDisplay::ScreenPause_Calibrate);
                        #endif // USES_DISPLAY
                    }
                } else if(pauseModeSelectingGunId) {
                    if(FW_Common::buttons.pressedReleased == FW_Const::BtnMask_A) {
                        gunIdModeSelection = (gunIdModeSelection == 0) ? 3 : (gunIdModeSelection - 1);
                        #ifdef USES_DISPLAY
                            FW_Common::OLED.PauseProfileUpdate(gunIdModeSelection, "P1", "P2", "P3", "P4");
                        #endif
                    } else if(FW_Common::buttons.pressedReleased == FW_Const::BtnMask_B) {
                        gunIdModeSelection = (gunIdModeSelection >= 3) ? 0 : (gunIdModeSelection + 1);
                        #ifdef USES_DISPLAY
                            FW_Common::OLED.PauseProfileUpdate(gunIdModeSelection, "P1", "P2", "P3", "P4");
                        #endif
                    } else if(FW_Common::buttons.pressedReleased == FW_Const::BtnMask_Trigger) {
                        OF_Prefs::settings[OF_Const::gunId] = gunIdModeSelection;
                        // 更新USB设备PID和名称
                        OF_Prefs::usb.devicePID = gunIdModeSelection + 1; // P1=1, P2=2, P3=3, P4=4
                        OF_Prefs::usb.deviceName[9] = '1' + gunIdModeSelection; // 更新名称中的P后面的数字
                        OF_Prefs::SaveSettings();
                        OF_Prefs::SaveUSBID();
                        pauseModeSelectingGunId = false;
                        FW_Common::pauseModeSelection = FW_Const::PauseMode_Calibrate;
                        if(!OF_Serial::serialMode) {
                            Serial.print("Gun ID set to P");
                            Serial.print((int)gunIdModeSelection + 1);
                            Serial.print(", USB PID: ");
                            Serial.println(OF_Prefs::usb.devicePID);
                            Serial.println("Please reconnect USB to apply changes.");
                        }
                        #ifdef USES_DISPLAY
                            {
                                char gunIdBuf[16];
                                snprintf(gunIdBuf, sizeof(gunIdBuf), "Gun ID: P%d", (int)gunIdModeSelection + 1);
                                FW_Common::OLED.TopPanelUpdate(gunIdBuf);
                            }
                            delay(800);
                            FW_Common::OLED.PauseListUpdate(ExtDisplay::ScreenPause_Calibrate);
                        #endif
                    } else if(FW_Common::buttons.pressedReleased & FW_Const::ExitPauseModeBtnMask) {
                        pauseModeSelectingGunId = false;
                        FW_Common::pauseModeSelection = FW_Const::PauseMode_Calibrate;
                        #ifdef USES_DISPLAY
                            FW_Common::OLED.PauseListUpdate(ExtDisplay::ScreenPause_Calibrate);
                        #endif
                    }
                } else if(FW_Common::buttons.pressedReleased == FW_Const::BtnMask_A) {
                    SetPauseModeSelection(false);
                } else if(FW_Common::buttons.pressedReleased == FW_Const::BtnMask_B) {
                    SetPauseModeSelection(true);
                } else if(FW_Common::buttons.pressedReleased == FW_Const::BtnMask_Trigger) {
                    switch(FW_Common::pauseModeSelection) {
                        case FW_Const::PauseMode_Calibrate:
                          FW_Common::SetMode(FW_Const::GunMode_Calibration);
                          if(!OF_Serial::serialMode) {
                              Serial.print("Calibrating for current profile: ");
                              Serial.println(OF_Prefs::profiles[OF_Prefs::currentProfile].name);
                          }
                          break;
                        case FW_Const::PauseMode_ProfileSelect:
                          if(!OF_Serial::serialMode) {
                              Serial.println("Pick a profile!");
                              Serial.print("Current profile in use: ");
                              Serial.print(OF_Prefs::profiles[OF_Prefs::currentProfile].name);
                              Serial.print(" (");
                              Serial.print(OF_Prefs::profiles[OF_Prefs::currentProfile].irLayout ? "Diamond" : "Square");
                              Serial.println(")");
                          }
                          pauseModeSelectingProfile = true;
                          profileModeSelection = OF_Prefs::currentProfile;
                          #ifdef USES_DISPLAY
                              // 为每个配置文件名称添加布局类型信息
                              char profileNames[4][20]; // 为每个配置文件创建带布局信息的名称
                              for(int i = 0; i < PROFILE_COUNT; i++) {
                                  // 根据irLayout值添加布局类型
                                  if(OF_Prefs::profiles[i].irLayout) {
                                      snprintf(profileNames[i], sizeof(profileNames[i]), "%s (Diamond)", OF_Prefs::profiles[i].name);
                                  } else {
                                      snprintf(profileNames[i], sizeof(profileNames[i]), "%s (Square)", OF_Prefs::profiles[i].name);
                                  }
                              }
                              FW_Common::OLED.PauseProfileUpdate(profileModeSelection, profileNames[0], profileNames[1], profileNames[2], profileNames[3]);
                          #endif // USES_DISPLAY
                          #ifdef LED_ENABLE
                              OF_RGB::SetLedPackedColor(OF_Prefs::profiles[OF_Prefs::currentProfile].color);
                          #endif // LED_ENABLE
                          break;
                        case FW_Const::PauseMode_Save:
                          if(!OF_Serial::serialMode)
                              Serial.println("Saving...");
                          FW_Common::SavePreferences();
                          break;
                        case FW_Const::PauseMode_AutofireToggle:
                          if(!OF_Serial::serialMode) {
                              Serial.println("Toggling autofire...");
                          }
                          OF_Prefs::toggles[OF_Const::autofire] = !OF_Prefs::toggles[OF_Const::autofire];
                          if(!OF_Serial::serialMode) {
                              Serial.print("Autofire is now ");
                              Serial.println(OF_Prefs::toggles[OF_Const::autofire] ? "ON" : "OFF");
                          }
                          #ifdef USES_DISPLAY
                              // 显示状态栏提示
                              FW_Common::OLED.TopPanelUpdate(OF_Prefs::toggles[OF_Const::autofire] ? "Autofire: ON" : "Autofire: OFF");
                              delay(1000); // 显示1秒状态提示
                              FW_Common::OLED.PauseListUpdate(ExtDisplay::ScreenPause_AutofireToggle);
                          #endif // USES_DISPLAY
                          #ifdef LED_ENABLE
                              if(OF_Prefs::toggles[OF_Const::autofire]) {
                                  OF_RGB::LedUpdate(0,255,0);
                              } else {
                                  OF_RGB::LedUpdate(255,0,0);
                              }
                              delay(200);
                              OF_RGB::SetLedPackedColor(OF_Prefs::profiles[OF_Prefs::currentProfile].color);
                          #endif // LED_ENABLE
                          OF_Prefs::SaveToggles();
                          break;                          
 //wei13402 add start
                         case FW_Const::PauseMode_ModeChange:
                          if(!OF_Serial::serialMode) {
                              Serial.println("Changing input mode...");
                          }
                          // Cycle through modes: Mouse/KB -> Gamepad -> MiSTer Optimized -> Mouse/KB
                          if(!FW_Common::buttons.analogOutput && !FW_Common::OLED.mister) {
                              // Current: Mouse/KB -> Switch to Gamepad
                              FW_Common::buttons.analogOutput = true;
                              FW_Common::UpdateBindings(false);  // Apply custom button mappings
                              if(!OF_Serial::serialMode)
                                  Serial.println("Mode changed to: Gamepad");
                          } else if(FW_Common::buttons.analogOutput && !FW_Common::OLED.mister) {
                              // Current: Gamepad -> Switch to MiSTer Optimized
                              FW_Common::OLED.mister = true;
                              if(!OF_Serial::serialMode)
                                  Serial.println("Mode changed to: MiSTer Optimized");
                          } else {
                              // Current: MiSTer Optimized -> Switch to Mouse/KB
                              FW_Common::buttons.analogOutput = false;
                              FW_Common::OLED.mister = false;
                              FW_Common::UpdateBindings(false);  // Apply custom button mappings
                              if(!OF_Serial::serialMode)
                                  Serial.println("Mode changed to: Mouse/Keyboard");
                          }
                          
                          // Save the new mode settings
                          OF_Prefs::toggles[OF_Const::analogOutputMode] = FW_Common::buttons.analogOutput;
                          OF_Prefs::toggles[OF_Const::misterMode] = FW_Common::OLED.mister;
                          OF_Prefs::SaveToggles();
                          
                          // Update display to show new mode
                          #ifdef USES_DISPLAY
                              // 显示状态栏提示
                              if(FW_Common::OLED.mister) {
                                  FW_Common::OLED.TopPanelUpdate("Mode Changed: MiSTer");
                              } else if(FW_Common::buttons.analogOutput) {
                                  FW_Common::OLED.TopPanelUpdate("Mode Changed: Gamepad");
                              } else {
                                  FW_Common::OLED.TopPanelUpdate("Mode Changed: Mouse/KB");
                              }
                              // 短暂显示状态后再更新菜单
                              delay(1000); // 显示1秒状态提示
                              FW_Common::OLED.PauseListUpdate(ExtDisplay::ScreenPause_ModeChange);
                          #endif // USES_DISPLAY
                          // Provide visual feedback
                          #ifdef LED_ENABLE
                              for(uint i = 0; i < 2; ++i) {
                                  OF_RGB::LedUpdate(0,255,255);
                                  delay(150);
                                  OF_RGB::LedOff();
                                  delay(100);
                              }
                          #endif // LED_ENABLE
                          break;
 //wei13102 add end
 //wei134102 add start
                         
                        case FW_Const::PauseMode_LowButtonToggle:
                          if(!OF_Serial::serialMode) {
                              Serial.println("Toggling Low Button Mode!");
                          }
                          OF_Prefs::toggles[OF_Const::lowButtonsMode] = !OF_Prefs::toggles[OF_Const::lowButtonsMode];
                          if(!OF_Serial::serialMode) {
                              Serial.print("Low Button Mode ");
                              Serial.println(OF_Prefs::toggles[OF_Const::lowButtonsMode] ? "ON" : "OFF");
                          }
                          // Update display to show new state
                          #ifdef USES_DISPLAY
                              // 显示状态栏提示
                              FW_Common::OLED.TopPanelUpdate(OF_Prefs::toggles[OF_Const::lowButtonsMode] ? "Low Button: ON" : "Low Button: OFF");
                              delay(1000); // 显示1秒状态提示
                              FW_Common::OLED.PauseListUpdate(ExtDisplay::ScreenPause_LowButtonToggle);
                          #endif // USES_DISPLAY
                          // Provide visual feedback
                          #ifdef LED_ENABLE
                              for(uint i = 0; i < 2; ++i) {
                                  OF_RGB::LedUpdate(255,165,0);
                                  delay(150);
                                  OF_RGB::LedOff();
                                  delay(100);
                              }
                          #endif // LED_ENABLE
                          OF_Prefs::SaveToggles();
                          // 更新按钮绑定以应用Low Button模式变更
                          FW_Common::UpdateBindings(false);
                          break;
                        case FW_Const::PauseMode_LayoutToggle:
                          if(!OF_Serial::serialMode) {
                              Serial.println("Toggling Layout Type!");
                          }
                          // Toggle between Diamond and Square layout
                          if(OF_Prefs::profiles[OF_Prefs::currentProfile].irLayout == OF_Const::layoutDiamond) {
                              OF_Prefs::profiles[OF_Prefs::currentProfile].irLayout = OF_Const::layoutSquare;
                          } else {
                              OF_Prefs::profiles[OF_Prefs::currentProfile].irLayout = OF_Const::layoutDiamond;
                          }
                          
                          if(!OF_Serial::serialMode) {
                              Serial.print("Layout changed to: ");
                              Serial.println(OF_Prefs::profiles[OF_Prefs::currentProfile].irLayout == OF_Const::layoutDiamond ? "Diamond" : "Square");
                          }
                          
