wei134102/OpenFIRE-Firmware-ESP32/src/main.cpp
                          // Update display to show new layout
                          #ifdef USES_DISPLAY
                              // 显示状态栏提示
                              FW_Common::OLED.TopPanelUpdate(OF_Prefs::profiles[OF_Prefs::currentProfile].irLayout == OF_Const::layoutDiamond ? "Layout: Diamond" : "Layout: Square");
                              delay(1000); // 显示1秒状态提示
                              FW_Common::OLED.PauseListUpdate(ExtDisplay::ScreenPause_LayoutToggle);
                          #endif // USES_DISPLAY
                          
                          // Provide visual feedback with color corresponding to layout type
                          #ifdef LED_ENABLE
                              if(OF_Prefs::profiles[OF_Prefs::currentProfile].irLayout == OF_Const::layoutDiamond) {
                                  // Diamond layout - purple
                                  OF_RGB::LedUpdate(128,0,128);
                              } else {
                                  // Square layout - blue
                                  OF_RGB::LedUpdate(0,0,255);
                              }
                              delay(500);
                              OF_RGB::SetLedPackedColor(OF_Prefs::profiles[OF_Prefs::currentProfile].color);
                          #endif // LED_ENABLE
                          
                          // Save the layout change
                          OF_Prefs::SaveProfiles();
                          
                          break;
                        case FW_Const::PauseMode_GunId:
                          pauseModeSelectingGunId = true;
                          gunIdModeSelection = (uint8_t)(OF_Prefs::settings[OF_Const::gunId] % 4);
                          if(!OF_Serial::serialMode) {
                              Serial.println("Gun ID: select P1-P4");
                          }
                          #ifdef USES_DISPLAY
                              FW_Common::OLED.PauseProfileUpdate(gunIdModeSelection, "P1", "P2", "P3", "P4");
                          #endif
                          break;
                        // 在这里插入新的 死区 case
                        case FW_Const::PauseMode_AnalogDeadzone:
                        // 死区步进：0,5,10,15,20,25,30%，用 Trigger 循环切换
                        {
                            // 当前值
                            uint32_t dz = OF_Prefs::settings[OF_Const::analogDeadzone];
                            if (dz > 30) dz = 30;

                            // 进入该选项时先显示当前死区值，避免画面空白
                            #ifdef USES_DISPLAY
                                {
                                    char buf[24];
                                    snprintf(buf, sizeof(buf), "Deadzone: %u%%", (unsigned)dz);
                                    FW_Common::OLED.TopPanelUpdate(buf);
                                    FW_Common::OLED.PauseListUpdate(ExtDisplay::ScreenPause_AnalogDeadzone);
                                }
                            #endif

                            // 这里已经是 Trigger 的一次“按下并松开”事件，不需要再检测 pressed
                            static const uint8_t steps[] = {0,5,10,15,20,25,30};
                            int index = 0;
                            for (int i = 0; i < 7; ++i) {
                                if (dz <= steps[i]) { index = i; break; }
                            }
                            // 下一档，循环
                            index = (index + 1) % 7;
                            dz = steps[index];
                            OF_Prefs::settings[OF_Const::analogDeadzone] = dz;
                            OF_Prefs::SaveSettings();

                            if (!OF_Serial::serialMode) {
                                Serial.print("Analog deadzone set to ");
                                Serial.print(dz);
                                Serial.println("%");
                            }
                            #ifdef USES_DISPLAY
                                char buf[24];
                                snprintf(buf, sizeof(buf), "Deadzone: %u%%", (unsigned)dz);
                                FW_Common::OLED.TopPanelUpdate(buf);
                                FW_Common::OLED.PauseListUpdate(ExtDisplay::ScreenPause_AnalogDeadzone);
                            #endif
                        }
                        break;                          
 //wei134102 add end                             
                        #ifdef USES_RUMBLE
                        case FW_Const::PauseMode_RumbleFFToggle:
                          if(!OF_Serial::serialMode)
                              Serial.println("Toggling Rumble FFB!");
                          // Toggle rumbleFF state
                          OF_Prefs::toggles[OF_Const::rumbleFF] = !OF_Prefs::toggles[OF_Const::rumbleFF];
                          
                          // Save the setting
                          OF_Prefs::SaveToggles();
                          
                          // Update display
                          #ifdef USES_DISPLAY
                              // 显示状态栏提示
                              FW_Common::OLED.TopPanelUpdate(OF_Prefs::toggles[OF_Const::rumbleFF] ? "Rumble FFB: ON" : "Rumble FFB: OFF");
                              delay(1000); // 显示1秒状态提示
                              FW_Common::OLED.PauseListUpdate(ExtDisplay::ScreenPause_RumbleFFToggle);
                          #endif // USES_DISPLAY
                          
                          // Provide visual feedback
                          #ifdef LED_ENABLE
                              if(OF_Prefs::toggles[OF_Const::rumbleFF]) {
                                  // Green for ON
                                  OF_RGB::LedUpdate(0,255,0);
                              } else {
                                  // Red for OFF
                                  OF_RGB::LedUpdate(255,0,0);
                              }
                              delay(500);
                              OF_RGB::SetLedPackedColor(OF_Prefs::profiles[OF_Prefs::currentProfile].color);
                          #endif // LED_ENABLE
                          
                          break;                        
                        case FW_Const::PauseMode_RumbleToggle:
                          if(!OF_Serial::serialMode)
                              Serial.println("Toggling rumble!");
                          RumbleToggle();
                          break;
                        #endif // USES_RUMBLE
                        #ifdef USES_SOLENOID
                        case FW_Const::PauseMode_SolenoidToggle:
                          if(!OF_Serial::serialMode)
                              Serial.println("Toggling solenoid!");
                          SolenoidToggle();
                          break;
                        #endif // USES_SOLENOID
                        /*
                        #ifdef USES_SOLENOID
                        case FW_Const::PauseMode_BurstFireToggle:
                          Serial.println("Toggling solenoid burst firing!");
                          BurstFireToggle();
                          break;
                        #endif // USES_SOLENOID
                        */
                        case FW_Const::PauseMode_EscapeSignal:
                          SendEscapeKey();

