wei134102/OpenFIRE-Firmware-ESP32/src/main.cpp
                    #ifdef PauseMode_RumbleFFToggle
                    if(FW_Common::pauseModeSelection == FW_Const::PauseMode_RumbleFFToggle &&
                    !(OF_Prefs::pins[OF_Const::rumblePin] >= 0)) {
                        FW_Common::pauseModeSelection--;
                    }
                    #endif // PauseMode_RumbleFFToggle                    
                #endif // USES_RUMBLE
            #endif // USES_SWITCHES
        }
    }

    switch(FW_Common::pauseModeSelection) {
        case FW_Const::PauseMode_Calibrate:
          Serial.println("Selecting: Calibrate current profile");
          #ifdef LED_ENABLE
              OF_RGB::LedUpdate(255,0,0);
          #endif // LED_ENABLE
          break;
        case FW_Const::PauseMode_ProfileSelect:
          Serial.println("Selecting: Switch profile");
          #ifdef LED_ENABLE
              OF_RGB::LedUpdate(200,50,0);
          #endif // LED_ENABLE
          break;
        case FW_Const::PauseMode_AutofireToggle:
          Serial.println("Selecting: Toggle autofire On/Off");
          #ifdef LED_ENABLE
              if(OF_Prefs::toggles[OF_Const::autofire]) {
                  OF_RGB::LedUpdate(0,255,0);
              } else {
                  OF_RGB::LedUpdate(255,0,0);
              }
          #endif // LED_ENABLE
          break;          
        //wei134102 add start
        case FW_Const::PauseMode_ModeChange:
          Serial.println("Selecting: Change input mode");
          #ifdef LED_ENABLE
              OF_RGB::LedUpdate(0,255,255);
          #endif // LED_ENABLE
          break; 
        case FW_Const::PauseMode_LowButtonToggle:
          Serial.println("Selecting: Low Button Toggle");
          #ifdef LED_ENABLE
              OF_RGB::LedUpdate(255,165,0);
          #endif // LED_ENABLE
          break;
        case FW_Const::PauseMode_LayoutToggle:
          Serial.println("Selecting: Layout Toggle");
          #ifdef LED_ENABLE
              // Show current layout color
              if(OF_Prefs::profiles[OF_Prefs::currentProfile].irLayout == OF_Const::layoutDiamond) {
                  OF_RGB::LedUpdate(128,0,128);
              } else {
                  OF_RGB::LedUpdate(0,0,255);
              }
          #endif // LED_ENABLE
          break;
        case FW_Const::PauseMode_RumbleFFToggle:
          Serial.println("Selecting: Toggle Rumble FFB On/Off");
          #ifdef LED_ENABLE
              if(OF_Prefs::toggles[OF_Const::rumbleFF]) {
                  OF_RGB::LedUpdate(0,255,0);
              } else {
                  OF_RGB::LedUpdate(255,0,0);
              }
          #endif // LED_ENABLE
          break;               
        //wei134102 add end
        case FW_Const::PauseMode_Save:
          Serial.println("Selecting: Save Settings");
          #ifdef LED_ENABLE
              OF_RGB::LedUpdate(155,100,0);
          #endif // LED_ENABLE
          break;
        #ifdef USES_RUMBLE
        case FW_Const::PauseMode_RumbleToggle:
          Serial.println("Selecting: Toggle rumble On/Off");
          #ifdef LED_ENABLE
              OF_RGB::LedUpdate(100,155,0);
          #endif // LED_ENABLE
          break;
        #endif // USES_RUMBLE
        #ifdef USES_SOLENOID
        case FW_Const::PauseMode_SolenoidToggle:
          Serial.println("Selecting: Toggle solenoid On/Off");
          #ifdef LED_ENABLE
              OF_RGB::LedUpdate(55,200,0);
          #endif // LED_ENABLE
          break;
        #endif // USES_SOLENOID
        /*#ifdef USES_SOLENOID
        case FW_Const::PauseMode_BurstFireToggle:
          Serial.println("Selecting: Toggle burst-firing mode");
          #ifdef LED_ENABLE
              OF_RGB::LedUpdate(0,255,0);
          #endif // LED_ENABLE
          break;
        #endif // USES_SOLENOID
        */
        case FW_Const::PauseMode_EscapeSignal:
          Serial.println("Selecting: Send Escape key signal");
          #ifdef LED_ENABLE
              OF_RGB::LedUpdate(150,0,150);
          #endif // LED_ENABLE
          break;
        /*case FW_Const::PauseMode_Exit:
          Serial.println("Selecting: Exit pause mode");
          break;
        */
        default:
          Serial.println("YOU'RE NOT SUPPOSED TO BE SEEING THIS");
          break;
    }
    #ifdef USES_DISPLAY
        FW_Common::OLED.PauseListUpdate(FW_Common::pauseModeSelection);
    #endif // USES_DISPLAY
}

// Simple Pause Mode - scrolls up/down profiles list
// Bool determines if it's incrementing or decrementing the list
// LEDs update according to the profile being scrolled on, if any.
void SetProfileSelection(const bool &isIncrement)
{
    if(isIncrement) {
        if(profileModeSelection >= PROFILE_COUNT - 1)
            profileModeSelection = 0;
        else profileModeSelection++;
    } else {
        if(profileModeSelection <= 0)
            profileModeSelection = PROFILE_COUNT - 1;
        else profileModeSelection--;
    }

    #ifdef LED_ENABLE
        OF_RGB::SetLedPackedColor(OF_Prefs::profiles[profileModeSelection].color);
    #endif // LED_ENABLE

    #ifdef USES_DISPLAY
        // 为每个配置文件名称添加布局类型信息
        char profileNames[4][20]; // 为每个配置文件创建带布局信息的名称
        for(int i = 0; i < PROFILE_COUNT; i++) {
            // 根据irLayout值添加布局类型
            if(OF_Prefs::profiles[i].irLayout) {
                snprintf(profileNames[i], sizeof(profileNames[i]), "%s (Diamond)", OF_Prefs::profiles[i].name);
            } else {
                snprintf(profileNames[i], sizeof(profileNames[i]), "%s (Square)", OF_Prefs::profiles[i].name);
            }
        }
        FW_Common::OLED.PauseProfileUpdate(profileModeSelection, profileNames[0], profileNames[1], profileNames[2], profileNames[3]);
    #endif // USES_DISPLAY

    Serial.print("Selecting profile: ");
    Serial.print(OF_Prefs::profiles[profileModeSelection].name);
    Serial.print(" (");
    Serial.print(OF_Prefs::profiles[profileModeSelection].irLayout ? "Diamond" : "Square");
    Serial.println(")");

    return;
}

void SelectCalProfileFromBtnMask(const uint32_t &mask)
{
    // only check if buttons are set in the mask
    if(!mask)
        return;

    for(uint i = 0; i < PROFILE_COUNT; ++i) {
        if(bitRead(mask, i)) {
            FW_Common::SelectCalProfile(i);
            return;
        }
    }
}

void IncreaseIrSensitivity(const uint32_t &sens)
{
    if(sens < DFRobotIRPositionEx::Sensitivity_Max)
        FW_Common::SetIrSensitivity(sens-1);
}

void DecreaseIrSensitivity(const uint32_t &sens)
{
    if(sens > DFRobotIRPositionEx::Sensitivity_Min)
        FW_Common::SetIrSensitivity(sens-1);
}

